import datetime

k = 3

def schedule():
    time=datetime.datetime.now()
    day=time.weekday()
    print(day)
    if day == 4:
        msgs="""[耶]早上好~
[太阳][太阳][太阳]周五课表[太阳][太阳][太阳]
[强]1-2节：概率论与数理统计 
             10#二合堂"""
    elif day == 1:
        msgs="""[耶]早上好~
[太阳][太阳][太阳]周二课表[太阳][太阳][太阳]
[强]1-2节：信号与系统
             11#403
[强]3-4节：概率论与数理统计 
             10#二合堂
[强]7-8节：中国近代史纲要
             10#一合堂"""
    elif day == 2:
        msgs="""[耶]早上好~
[太阳][太阳][太阳]周三课表[太阳][太阳][太阳]
[强]1-2节：数字电路 
             1#516"""
    elif day == 3:
        msgs="""[耶]早上好~
[太阳][太阳][太阳]周四课表[太阳][太阳][太阳]
[强]1-2节：大学英语
             1#703
[强]3-4节：信号与系统
             1#516
[强]5-6节：体育"""
    elif day == 0:
        msgs="""[耶]早上好~
[太阳][太阳][太阳]周一课表[太阳][太阳][太阳]
[强]1-2节：数字电路 
             1#709
[强]5-6节：信号与系统实验
             3#501
             """
    else:
        msgs='''[耶]早上好~
    今天是周末没有课，愉快的一天从每日问候开始'''
    return(msgs)

def greetins():
    msgs = '123'
    return(msgs)

